added visuals
